## [DataFrame 행 /열 추가]

(1) 모듈 로딩

In [1]:
import pandas as pd

(2) 데이터 준비

In [2]:
#dict 타입의 데이터 생성
exam={'이름':['마징가','배트맨','홍길동','임꺽정'],
      '국어':[ 98,79,99,100],
       '미술':[ 70,99,87,80],
       '수학':[ 98,70,100,72],
       '체육':[ 80,93,69,91] }

(3)DataFrame에 데이터 저장<hr>

In [3]:
examDF=pd.DataFrame(exam)

In [4]:
examDF

    이름   국어  미술   수학  체육
0  마징가   98  70   98  80
1  배트맨   79  99   70  93
2  홍길동   99  87  100  69
3  임꺽정  100  80   72  91

(4) 저장된 데이터 속성 확인<hr>

In [5]:
def printAttribute(df,dfname):
    print(f'[{dfname} Attributes]')
    print(f'index\n===> {df.index}')
    print(f'columns\n===> {df.columns}')
    print(f'shape\n===> {df.shape}')
    print(f'ndim\n===> {df.ndim}')  #시리즈 출력된다.
    print(f'size\n===> {df.size}')
    print(f'dtypes\n===> {df.dtypes}')

In [6]:
printAttribute(examDF,'examDF')

[examDF Attributes]
index
===> RangeIndex(start=0, stop=4, step=1)
columns
===> Index(['이름', '국어', '미술', '수학', '체육'], dtype='object')
shape
===> (4, 5)
ndim
===> 2
size
===> 20
dtypes
===> 이름    object
국어     int64
미술     int64
수학     int64
체육     int64
dtype: object

In [7]:
print(f'index\n===> {examDF.index}')

index
===> RangeIndex(start=0, stop=4, step=1)

In [8]:
print(f'columns\n===> {examDF.columns}')

columns
===> Index(['이름', '국어', '미술', '수학', '체육'], dtype='object')

In [9]:
print(f'shape\n===> {examDF.shape}')

shape
===> (4, 5)

In [10]:
print(f'ndim\n===> {examDF.ndim}')

ndim
===> 2

In [11]:
print(f'dtypes\n===> {examDF.dtypes}')

dtypes
===> 이름    object
국어     int64
미술     int64
수학     int64
체육     int64
dtype: object

(5)DataFrame에 컬럼 추가<hr>
- 방법:DF객체변수명[새로운컬럼명]=값

In [12]:
examDF.columns

Index(['이름', '국어', '미술', '수학', '체육'], dtype='object')

In [15]:
#행 갯수 만큼 값 추가
examDF['영어']=[90,89,100,99]

In [14]:
examDF

    이름   국어  미술   수학  체육   영어
0  마징가   98  70   98  80   90
1  배트맨   79  99   70  93   89
2  홍길동   99  87  100  69  100
3  임꺽정  100  80   72  91   99

In [18]:
examDF['과학']=10   #한개의 데이터 즉 값 추가 시 모든 행에 동일 값으로 저장

In [17]:
examDF

    이름   국어  미술   수학  체육   영어  과학
0  마징가   98  70   98  80   90  10
1  배트맨   79  99   70  93   89  10
2  홍길동   99  87  100  69  100  10
3  임꺽정  100  80   72  91   99  10

In [20]:
examDF[6]=0   # 행의 수만큼 주던지, 아니면 값을 한개만 줘야한다.리스트를 주었으므로 리스트 개수에 맞게 해줘야 함

In [21]:
examDF

    이름   국어  미술   수학  체육   영어  과학  6
0  마징가   98  70   98  80   90  10  0
1  배트맨   79  99   70  93   89  10  0
2  홍길동   99  87  100  69  100  10  0
3  임꺽정  100  80   72  91   99  10  0

In [22]:
examDF.columns

Index(['이름', '국어', '미술', '수학', '체육', '영어', '과학', 6], dtype='object')

(6) DataFrame에 행(row) 추가 <hr>
- 방법 : DF객체변수명.loc[새로운 행인덱스] =[컬럼수 만큼 데이터]
- 방법 : DF객체변수명.loc[새로운 행인덱스] =데이터
- 불가방법 : DF객체변수명.loc[새로운 행인덱스] =데이터=> 데이터가 존재해야지 인덱스가 할당되므로...

In [23]:
examDF.index

RangeIndex(start=0, stop=4, step=1)

In [25]:
# 컬럼 수 만큼의 데이터를 가진 행 추가
examDF.loc[4]=['원더우먼',90,87,99,87,67,80,100]

In [26]:
examDF

     이름   국어  미술   수학  체육   영어  과학    6
0   마징가   98  70   98  80   90  10    0
1   배트맨   79  99   70  93   89  10    0
2   홍길동   99  87  100  69  100  10    0
3   임꺽정  100  80   72  91   99  10    0
4  원더우먼   90  87   99  87   67  80  100

In [33]:
# 행 추가시 iloc는 사용할수 없음, => why? 데이터 수에 맞게 인덱스 범위 지정이 되기 때문에
# 현재 인덱스에 없는 인덱스로 불가.....
# examDF.iloc[5]=['슈퍼맨',90,87,99,87,67,80,100]

In [34]:
# 한 개의 데이터를 가진 행 추가
examDF.loc[5]='슈퍼맨'

In [35]:
examDF

    이름   국어   미술   수학   체육   영어   과학    6
0  마징가   98   70   98   80   90   10    0
1  배트맨   79   99   70   93   89   10    0
2  홍길동   99   87  100   69  100   10    0
3  임꺽정  100   80   72   91   99   10    0
4  슈퍼맨   90   87   99   87   67   80  100
5  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨